cmsis-svd/cmsis-svd/data/Spansion/MB9AF42xK_svd.xml
        <!-- REGISTER "OCU_OCSB10" -->
        <register>
          <name>OCU_OCSB10</name>
          <description> register OCU_OCSB10 </description>
          <addressOffset>0x19</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x60</resetValue>
          <resetMask>0x73</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "OTD0" -->
            <field>
              <name>OTD0</name>
              <description> bitfield OTD0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OTD1" -->
            <field>
              <name>OTD1</name>
              <description> bitfield OTD1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CMOD" -->
            <field>
              <name>CMOD</name>
              <description> bitfield CMOD </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BTS0" -->
            <field>
              <name>BTS0</name>
              <description> bitfield BTS0 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BTS1" -->
            <field>
              <name>BTS1</name>
              <description> bitfield BTS1 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "OCU_OCSB32" -->
        <register derivedFrom="OCU_OCSB10">
          <name>OCU_OCSB32</name>
          <description> register OCU_OCSB32 </description>
          <addressOffset>0x1D</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCSB54" -->
        <register derivedFrom="OCU_OCSB10">
          <name>OCU_OCSB54</name>
          <description> register OCU_OCSB54 </description>
          <addressOffset>0x21</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCSC" -->
        <register>
          <name>OCU_OCSC</name>
          <description> register OCU_OCSC </description>
          <addressOffset>0x24</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x3F00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MOD0" -->
            <field>
              <name>MOD0</name>
              <description> bitfield MOD0 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOD1" -->
            <field>
              <name>MOD1</name>
              <description> bitfield MOD1 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOD2" -->
            <field>
              <name>MOD2</name>
              <description> bitfield MOD2 </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOD3" -->
            <field>
              <name>MOD3</name>
              <description> bitfield MOD3 </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOD4" -->
            <field>
              <name>MOD4</name>
              <description> bitfield MOD4 </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOD5" -->
            <field>
              <name>MOD5</name>
              <description> bitfield MOD5 </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "OCU_OCCP0" -->
        <register>
          <name>OCU_OCCP0</name>
          <description> register OCU_OCCP0 </description>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "OCU_OCCP1" -->
        <register derivedFrom="OCU_OCCP0">
          <name>OCU_OCCP1</name>
          <description> register OCU_OCCP1 </description>
          <addressOffset>0x4</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCCP2" -->
        <register derivedFrom="OCU_OCCP0">
          <name>OCU_OCCP2</name>
          <description> register OCU_OCCP2 </description>
          <addressOffset>0x8</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCCP3" -->
        <register derivedFrom="OCU_OCCP0">
          <name>OCU_OCCP3</name>
          <description> register OCU_OCCP3 </description>
          <addressOffset>0xC</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCCP4" -->
        <register derivedFrom="OCU_OCCP0">
          <name>OCU_OCCP4</name>
          <description> register OCU_OCCP4 </description>
          <addressOffset>0x10</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCCP5" -->
        <register derivedFrom="OCU_OCCP0">
          <name>OCU_OCCP5</name>
          <description> register OCU_OCCP5 </description>
          <addressOffset>0x14</addressOffset>
        </register>
        <!-- REGISTER "WFG_WFSA10" -->
        <register>
          <name>WFG_WFSA10</name>
          <description> register WFG_WFSA10 </description>
          <addressOffset>0x8C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x1FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DCK" -->
            <field>
              <name>DCK</name>
              <description> bitfield DCK </description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TMD" -->
            <field>
              <name>TMD</name>
              <description> bitfield TMD </description>
              <lsb>3</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "GTEN" -->
            <field>
              <name>GTEN</name>
              <description> bitfield GTEN </description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PSEL" -->
            <field>
              <name>PSEL</name>
              <description> bitfield PSEL </description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PGEN" -->
            <field>
              <name>PGEN</name>
              <description> bitfield PGEN </description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DMOD" -->
            <field>
              <name>DMOD</name>
              <description> bitfield DMOD </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WFG_WFSA32" -->
        <register derivedFrom="WFG_WFSA10">
          <name>WFG_WFSA32</name>
          <description> register WFG_WFSA32 </description>
          <addressOffset>0x90</addressOffset>
        </register>
