cmsis-svd/cmsis-svd/data/Spansion/MB9AF42xK_svd.xml
        <!-- REGISTER "ELVR" -->
        <register>
          <name>ELVR</name>
          <description> register ELVR </description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xF000F0FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LB15" -->
            <field>
              <name>LB15</name>
              <description> bitfield LB15 </description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA15" -->
            <field>
              <name>LA15</name>
              <description> bitfield LA15 </description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB14" -->
            <field>
              <name>LB14</name>
              <description> bitfield LB14 </description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA14" -->
            <field>
              <name>LA14</name>
              <description> bitfield LA14 </description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB7" -->
            <field>
              <name>LB7</name>
              <description> bitfield LB7 </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA7" -->
            <field>
              <name>LA7</name>
              <description> bitfield LA7 </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB6" -->
            <field>
              <name>LB6</name>
              <description> bitfield LB6 </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA6" -->
            <field>
              <name>LA6</name>
              <description> bitfield LA6 </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB3" -->
            <field>
              <name>LB3</name>
              <description> bitfield LB3 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA3" -->
            <field>
              <name>LA3</name>
              <description> bitfield LA3 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB2" -->
            <field>
              <name>LB2</name>
              <description> bitfield LB2 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA2" -->
            <field>
              <name>LA2</name>
              <description> bitfield LA2 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB1" -->
            <field>
              <name>LB1</name>
              <description> bitfield LB1 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA1" -->
            <field>
              <name>LA1</name>
              <description> bitfield LA1 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB0" -->
            <field>
              <name>LB0</name>
              <description> bitfield LB0 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA0" -->
            <field>
              <name>LA0</name>
              <description> bitfield LA0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ELVR1" -->
        <register>
          <name>ELVR1</name>
          <description> register ELVR1 </description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LB21" -->
            <field>
              <name>LB21</name>
              <description> bitfield LB21 </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA21" -->
            <field>
              <name>LA21</name>
              <description> bitfield LA21 </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB20" -->
            <field>
              <name>LB20</name>
              <description> bitfield LB20 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA20" -->
            <field>
              <name>LA20</name>
              <description> bitfield LA20 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB19" -->
            <field>
              <name>LB19</name>
              <description> bitfield LB19 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA19" -->
            <field>
              <name>LA19</name>
              <description> bitfield LA19 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB18" -->
            <field>
              <name>LB18</name>
              <description> bitfield LB18 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA18" -->
            <field>
              <name>LA18</name>
              <description> bitfield LA18 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB17" -->
            <field>
              <name>LB17</name>
              <description> bitfield LB17 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA17" -->
            <field>
              <name>LA17</name>
              <description> bitfield LA17 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB16" -->
            <field>
              <name>LB16</name>
              <description> bitfield LB16 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA16" -->
            <field>
              <name>LA16</name>
              <description> bitfield LA16 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "NMIRR" -->
        <register>
          <name>NMIRR</name>
          <description> register NMIRR </description>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "NR" -->
            <field>
              <name>NR</name>
              <description> bitfield NR </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "NMICL" -->
        <register>
          <name>NMICL</name>
          <description> register NMICL </description>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x01</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "NCL" -->
            <field>
              <name>NCL</name>
              <description> bitfield NCL </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
